[
    {
        "nivel": "MAT1",
        "codigo": "1.1",
        "descripcion": "Iniciarse en la interpretación de problemas matemáticos sencillos, reconociendo los datos dados, estableciendo, de manera básica, las relaciones entre ellos y comprendiendo las preguntas formuladas.",
        "saberes": [
            "MAT.1.A.2.1",
            "MAT.1.A.2.3",
            "MAT.1.E.1.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "1.2",
        "descripcion": "Aplicar, en problemas de contextos cercanos de la vida cotidiana, herramientas y estrategias apropiadas, como pueden ser la descomposici ón en problemas más sencillos, el tanteo, el ensayo y error o la búsqueda de patrones, que contribuyan a la resolución de problemas de su entorno más cercano.",
        "saberes": [
            "MAT.1.A.3.1",
            "MAT.1.B.1.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "1.3",
        "descripcion": "Obtener las soluciones matemáticas en problemas de contextos cercanos de la vida cotidiana, activando los conocimientos necesarios, aceptando el error como parte del proceso.",
        "saberes": [
            "MAT.1.A.2.2",
            "MAT.1.A.3.4",
            "MAT.1.F.1.3"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "2.1",
        "descripcion": "Comprobar, de forma razonada la corrección de las soluciones de un problema, usando herramientas digitales como calculadoras, hojas de cálculo o programas específicos.",
        "saberes": [
            "MAT.1.A.3.5"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "2.2",
        "descripcion": "Comprobar, mediante la lectura comprensiva, la validez de las soluciones obtenidas en un problema comprobando su coherencia en el contexto planteado y evaluando el alcance y repercusión de estas soluciones desde diferentes perspectivas: igualdad de género, sostenibilidad, consumo responsable, equidad o no discriminación.",
        "saberes": [
            "MAT.1.A.6",
            "MAT.1.B.2",
            "MAT.1.F.3.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "3.1",
        "descripcion": "Formular y comprobar conjeturas sencillas en situaciones del entorno cercano, de forma guiada, trabajando de forma individual o colectiva la utilización del razonamiento inductivo para formular argumentos matemáticos, analizando patrones, propiedades y relaciones.",
        "saberes": [
            "MAT.1.A.3.3",
            "MAT.1.B.1.1"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "3.2",
        "descripcion": "Plantear, en términos matemáticos, variantes de un problema dado, en contextos cercanos de la vida cotidiana, modificando alguno de sus datos o alguna condición del problema, enriqueciendo así los conceptos matemáticos.",
        "saberes": [
            "MAT.1.D.4.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "3.3",
        "descripcion": "Emplear herramientas tecnológicas adecuadas, calculadoras o software matemáticos como paquetes estadísticos o programas de análisis numérico en la investigación y comprobación de conjeturas o problemas.",
        "saberes": [
            "MAT.1.E.2.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "4.1",
        "descripcion": "Reconocer patrones en la resolución de problemas sencillos, organizar datos y descomponer un problema en partes más simples, facilitando su interpretación computacional y relacionando los aspectos básicos de la informática con las necesidades del alumnado.",
        "saberes": [
            "MAT.1.A.1.1"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "4.2",
        "descripcion": "Modelizar situaciones del entorno cercano y resolver problemas sencillos de forma eficaz, interpretando y modificando algoritmos, creando modelos de situaciones cotidianas.",
        "saberes": [
            "MAT.1.D.1",
            "MAT.1.D.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "5.1",
        "descripcion": "Reconocer y usar las relaciones entre los conocimientos y experiencias matemáticas de los bloques de saberes formando un todo coherente, reconociendo y utilizando las conexiones entre ideas matemáticas en la resolución de problemas sencillos del entorno cercano.",
        "saberes": [
            "MAT.1.A.3.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "5.2",
        "descripcion": "Realizar conexiones entre diferentes procesos matemáticos sencillos, aplicando conocimiento s y experiencias previas y enlazándolas con las nuevas ideas.",
        "saberes": [
            "MAT.1.A.2.5",
            "MAT.1.A.4.1"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "6.1",
        "descripcion": "Reconocer situaciones en el entorno más cercano susceptibles de ser formuladas y resueltas mediante herramientas y estrategias matemáticas, estableciendo conexiones entre el mundo real y las matemáticas y usando los procesos inherentes a la investigación científica y matemática: inferir, medir, comunicar, clasificar y predecir, aplicando procedimientos sencillos en la resolución de problemas.",
        "saberes": [
            "MAT.1.A.1.2",
            "MAT.1.A.5.1",
            "MAT.1.A.5.2",
            "MAT.1.E.1.1",
            "MAT.1.E.2.1"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "6.2",
        "descripcion": "Analizar conexiones coherentes entre ideas y conceptos matemáticos con otras materias y con la vida real y aplicarlas mediante el uso de procedimient os sencillos en la resolución de problemas en situaciones del entorno cercano.",
        "saberes": [
            "MAT.1.D.4.1"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "6.3",
        "descripcion": "Reconocer en diferentes contextos del entorno más cercano, la aportación de las matemáticas al progreso de la humanidad y su contribución a la superación de los retos que demanda la sociedad actual, identificando algunas aportaciones hechas desde nuestra comunidad.",
        "saberes": [
            "MAT.1.E.2.3",
            "MAT.1.F.3.2",
            "MAT.1.F.3.3"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "7.1",
        "descripcion": "Representar conceptos, procedimientos, información y resultados matemáticos usando herramientas digitales sencillas, y formas de representació n adecuadas para visualizar ideas y estructurar procesos matemáticos, interpretando y resolviendo problemas del entorno cercano y valorando su utilidad para compartir información.",
        "saberes": [
            "MAT.1.A.2.4",
            "MAT.1.E.1.2",
            "MAT.1.E.1.3"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "7.2",
        "descripcion": "Esbozar representaciones matemáticas utilizando herramientas de interpretación y modelización como expresiones simbólicas o gráficas que ayuden en la búsqueda de estrategias de resolución de una situación problematizada.",
        "saberes": [
            "MAT.1.A.5.3",
            "MAT.1.E.1.4"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "8.1",
        "descripcion": "Comunicar ideas, conceptos y procesos sencillos, utilizando el lenguaje matemático apropiado, empleando diferentes medios, incluidos los digitales, oralmente y por escrito, al describir, explicar y justificar sus conocimientos matemáticos.",
        "saberes": [
            "MAT.1.D.3"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático presente en contextos cotidianos de su entorno personal, expresando y comunicando mensajes con contenido matemático y utilizando terminología matemática adecuada con precisión y rigor.",
        "saberes": [
            "MAT.1.A.4.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "9.1",
        "descripcion": "Gestionar las emociones propias y desarrollar el autoconcepto matemático como herramienta, generando expectativas positivas en la adaptación, el tratamiento y la gestión de retos matemáticos y cambios en contextos cotidianos de su entorno personal e iniciándose en el pensamiento crítico y creativo.",
        "saberes": [
            "MAT.1.F.1.1"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando la crítica razonada, analizando sus limitaciones y buscando ayuda al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MAT.1.F.1.2",
            "MAT.1.F.1.3"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "10.1",
        "descripcion": "Colaborar activamente y construir relaciones saludables en el trabajo de las matemáticas en equipos heterogéneos, respetando diferentes opiniones, iniciándose en el desarrollo de destrezas: de comunicación efectiva, de planificación, de indagación, de motivación y confianza en sus propias posibilidades y de pensamiento crítico y creativo, tomando decisiones y realizando juicios informados.",
        "saberes": [
            "MAT.1.F.2.1",
            "MAT.1.F.2.2"
        ]
    },
    {
        "nivel": "MAT1",
        "codigo": "10.2",
        "descripcion": "Participar en el reparto de tareas que deban desarrollarse en equipo, aportando valor, asumiendo las normas de convivencia, y aplicándolas de manera constructiva, dialogante e inclusiva, reconociendo los estereotipos e ideas preconcebidas sobre las matemáticas asociadas a cuestiones individuales y responsabilizándose de la propia contribución al equipo.",
        "saberes": [
            "MAT.1.F.2.1",
            "MAT.1.F.3.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "1.1",
        "descripcion": "Interpretar problemas matemáticos de la vida cotidiana, organizando los datos dados, estableciendo las relaciones entre ellos y comprendiendo las preguntas formuladas.",
        "saberes": [
            "MAT.2.A.2.1",
            "MAT.2.A.2.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "1.2",
        "descripcion": "Aplicar, en problemas de la vida cotidiana, herramientas y estrategias apropiadas, como pueden ser la descomposición en problemas más sencillos, el tanteo, la estimación, el ensayo y error o la búsqueda de patrones, que contribuyan a la resolución de problemas en situaciones diversas.",
        "saberes": [
            "MAT.2.A.3.1",
            "MAT.2.B.1.2",
            "MAT.2.B.2.1",
            "MAT.2.D.4.2"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "1.3",
        "descripcion": "Obtener las soluciones matemáticas en problemas de la vida cotidiana, activando los conocimientos necesarios, utilizando las herramientas tecnológicas necesarias, interpretando los resultados y aceptando el error como parte del proceso.",
        "saberes": [
            "MAT.2.A.2.2",
            "MAT.2.A.3.4",
            "MAT.2.F.1.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "2.1",
        "descripcion": "Comprobar, mediante el razonamiento matemático la corrección de las soluciones de un problema, usando herramientas digitales como calculadoras, hojas de cálculo o programas específicos.",
        "saberes": [
            "MAT.2.A.3.5",
            "MAT.2.D.4.4",
            "MAT.2.D.5.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "2.2",
        "descripcion": "Comprobar, mediante la lectura comprensiva, la validez de las soluciones obtenidas en un problema, comprobando su coherencia en el contexto planteado y evaluando el alcance y repercusión de estas soluciones desde diferentes perspectivas: igualdad de género, sostenibilidad, consumo responsable, equidad o no discriminación.",
        "saberes": [
            "MAT.2.A.6",
            "MAT.2.B.3",
            "MAT.2.F.3.2"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "3.1",
        "descripcion": "Formular y comprobar conjeturas sencillas en situaciones del mundo real de forma guiada, trabajando de forma individual o colectiva la utilización del razonamiento inductivo y deductivo para formular argumentos matemáticos, analizando patrones, propiedades y relaciones, y examinando su validez.",
        "saberes": [
            "MAT.2.A.3.3",
            "MAT.2.B.1.1",
            "MAT.2.D.4.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "3.2",
        "descripcion": "Plantear, en términos matemáticos, variantes de un problema dado, en contextos de la vida cotidiana, modificando alguno de sus datos o alguna condición del problema, consolidando así los conceptos matemáticos.",
        "saberes": [
            "MAT.2.D.5.2",
            "MAT.2.D.6.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "3.3",
        "descripcion": "Emplear herramientas tecnológicas adecuadas, calculadoras o software matemáticos como entornos de geometría dinámica; paquetes estadísticos o programas de análisis numérico, en la investigación y comprobación de conjeturas o problemas.",
        "saberes": [
            "MAT.2.C.1.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "4.1",
        "descripcion": "Reconocer patrones en la resolución de problemas complejos, organizar datos y descomponer un problema en partes más simples facilitando su interpretación computacional y relacionando los aspectos fundamentales de la informática con las necesidades del alumnado.",
        "saberes": [
            "MAT.2.A.1.1",
            "MAT.2.D.6.2",
            "MAT.2.D.6.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "4.2",
        "descripcion": "Modelizar situaciones de la vida cotidiana y resolver problemas de forma eficaz, interpretando y modificando algoritmos, creando modelos abstractos de situaciones cotidianas.",
        "saberes": [
            "MAT.2.C.4.1",
            "MAT.2.D.1",
            "MAT.2.D.2.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "5.1",
        "descripcion": "Reconocer y usar las relaciones entre los conocimientos y experiencias matemáticas de los bloques de saberes y de los distintos niveles formando un todo coherente, reconociendo y utilizando las conexiones entre ideas matemáticas en la resolución de problemas de la vida cotidiana.",
        "saberes": [
            "MAT.2.A.3.2",
            "MAT.2.C.1.1",
            "MAT.2.C.1.2",
            "MAT.2.C.2"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "5.2",
        "descripcion": "Realizar conexiones entre diferentes procesos matemáticos y entender cómo unas ideas se construyen sobre otras, aplicando conocimientos y experiencias previas y enlazándolas con las nuevas ideas.",
        "saberes": [
            "MAT.2.A.2.5",
            "MAT.2.A.4.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "6.1",
        "descripcion": "Reconocer situaciones en diferentes contextos (personal, escolar y social) susceptibles de ser formuladas y resueltas mediante herramientas y estrategias matemáticas, estableciendo conexiones entre el mundo real y las matemáticas usando los procesos inherentes a la investigación científica y matemática: inferir, medir, comunicar, clasificar y predecir, aplicando distintos procedimientos sencillos en la resolución de problemas en situaciones diversas.",
        "saberes": [
            "MAT.2.A.1.2",
            "MAT.2.A.5.1",
            "MAT.2.A.5.2"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "6.2",
        "descripcion": "Analizar conexiones coherentes entre ideas y conceptos matemáticos con otras materias y con la vida real y aplicarlas mediante el uso de procedimientos sencillos en la resolución de problemas en situaciones de la vida cotidiana.",
        "saberes": [
            "MAT.2.C.3.2",
            "MAT.2.D.2.2",
            "MAT.2.D.4.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "6.3",
        "descripcion": "Reconocer en diferentes contextos (personal, escolar y social), la aportación de las matemáticas al progreso de la humanidad y su contribución a la superación de los retos que demanda la sociedad actual, identificando algunas aportaciones hechas desde nuestra comunidad.",
        "saberes": [
            "MAT.2.F.3.2",
            "MAT.2.F.3.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "7.1",
        "descripcion": "Representar conceptos, procedimientos, información y resultados matemáticos usando diferentes herramientas digitales y formas de representación adecuadas para visualizar ideas y estructurar procesos matemáticos, interpretando y resolviendo problemas de la vida real de relativa complejidad y valorando su utilidad para compartir información.",
        "saberes": [
            "MAT.2.A.2.4",
            "MAT.2.B.2.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "7.2",
        "descripcion": "Elaborar, en el contexto del problema, representaciones matemáticas, utilizando herramientas de interpretación y modelización como expresiones simbólicas o gráficas que ayuden a tomar decisiones en la búsqueda de estrategias de resolución de una situación problematizada.",
        "saberes": [
            "MAT.2.A.5.3",
            "MAT.2.B.2.2"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "8.1",
        "descripcion": "Comunicar ideas, conceptos y procesos, utilizando el lenguaje matemático apropiado y empleando diferentes medios, incluidos los digitales, oralmente y por escrito, al describir, explicar y justificar razonamientos, procedimientos y conclusiones.",
        "saberes": [
            "MAT.2.D.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático presente en los ámbitos personal, social y educativo, expresando y comunicando mensajes con contenido matemático y utilizando terminología matemática adecuada de forma clara, precisa, rigurosa y veraz.",
        "saberes": [
            "MAT.2.A.4.2",
            "MAT.2.D.5.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "9.1",
        "descripcion": "Gestionar las emociones propias y desarrollar el autoconcepto matemático como herramienta, generando expectativas positivas ante el tratamiento y la gestión de retos matemáticos y cambios, desarrollando, de manera progresiva, el pensamiento crítico y creativo, adaptándose ante la incertidumbre y reconociendo fuentes de estrés.",
        "saberes": [
            "MAT.2.F.1.1"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando la crítica razonada, tomando conciencia de los errores cometidos y reflexionando sobre su propio esfuerzo y dedicación personal al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MAT.2.F.1.2",
            "MAT.2.F.1.3"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "10.1",
        "descripcion": "Colaborar activamente y construir relaciones saludables en el trabajo de las matemáticas en equipos heterogéneos, respetando diferentes opiniones, desarrollando destrezas: de comunicación efectiva, de planificación, de indagación, de motivación y confianza en sus propias posibilidades y de pensamiento crítico y creativo, tomando decisiones y realizando juicios informados.",
        "saberes": [
            "MAT.2.F.2.1",
            "MAT.2.F.2.2"
        ]
    },
    {
        "nivel": "MAT2",
        "codigo": "10.2",
        "descripcion": "Participar en el reparto de tareas que deban desarrollarse en equipo, aportando valor, favoreciendo la inclusión, la escucha activa, participando de forma respetuosa, dialogante y constructiva, asumiendo el rol asignado, analizando los estereotipos e ideas preconcebidas sobre las matemáticas asociadas a cuestiones individuales y responsabilizándo se de la propia contribución al equipo.",
        "saberes": [
            "MAT.2.F.2.1",
            "MAT.2.F.3.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "1.1",
        "descripcion": "Interpretar problemas matemáticos complejos, organizando y analizando los datos, estableciendo las relaciones entre ellos y comprendiendo las preguntas formuladas.",
        "saberes": [
            "MAT.3.A.2.1",
            "MAT.3.A.2.3",
            "MAT.3.B.2.4",
            "MAT.3.E.1.2",
            "MAT.3.E.2.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "1.2",
        "descripcion": "Aplicar, en problemas de la vida cotidiana y propios de las matemáticas, herramientas y estrategias apropiadas como pueden ser la analogía con otros problemas, la resolución de manera inversa (ir hacia atrás), la descomposición en problemas más sencillos, el tanteo, la estimación, el ensayo y error o la búsqueda de patrones, etc., que contribuyan a la resolución de problemas en situaciones de diversa complejidad.",
        "saberes": [
            "MAT.3.A.3.1",
            "MAT.3.B.1.2",
            "MAT.3.D.4.2",
            "MAT.3.E.2.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "1.3",
        "descripcion": "Obtener las soluciones matemáticas en problemas de diversa complejidad, activando los conocimientos, utilizando las herramientas tecnológicas necesarias y,  valorando e interpretando los resultados, aceptando el error como parte del proceso.",
        "saberes": [
            "MAT.3.A.2.2",
            "MAT.3.A.3.4",
            "MAT.3.E.1.6",
            "MAT.3.F.1.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "2.1",
        "descripcion": "Comprobar, mediante el razonamiento matemático y científico la corrección de las soluciones de un problema, usando herramientas digitales como calculadoras, hojas de cálculo o programas específicos.",
        "saberes": [
            "MAT.3.A.3.5",
            "MAT.3.D.4.4",
            "MAT.3.D.5.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "2.2",
        "descripcion": "Comprobar, mediante la lectura comprensiva y verificando su idoneidad, la validez de las soluciones obtenidas en un problema, comprobando su coherencia en el contexto planteado y evaluando el alcance y repercusión de estas soluciones desde diferentes perspectivas de igualdad de género, sostenibilidad, consumo responsable, equidad o no discriminación.",
        "saberes": [
            "MAT.3.A.6.2",
            "MAT.3.B.3.2",
            "MAT.3.F.3.2"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "3.1",
        "descripcion": "Investigar y comprobar conjeturas sencillas tanto en situaciones del mundo real como abstractas de forma autónoma, trabajando de forma individual o colectiva la utilización del razonamiento inductivo y deductivo para formular argumentos matemáticos, analizando patrones, propiedades y relaciones, examinando su validez y reformulándolas para obtener nuevas conjeturas susceptibles de ser puestas a prueba.",
        "saberes": [
            "MAT.3.A.3.3",
            "MAT.3.B.1.1",
            "MAT.3.B.3.1",
            "MAT.3.D.4.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "3.2",
        "descripcion": "Plantear, proporcionando una representación matemática adecuada, variantes de un problema dado, en diversos contextos, modificando alguno de sus  datos o reformulando alguna condición del problema, consolidando así los conceptos matemáticos y ejercitando diferentes saberes conocidos.",
        "saberes": [
            "MAT.3.D.5.2",
            "MAT.3.D.6.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "3.3",
        "descripcion": "Emplear herramientas tecnológicas adecuadas, calculadoras o software matemáticos como: Sistemas Algebraicos Computacionales (CAS); entornos de geometría dinámica; paquetes estadísticos o programas de análisis numérico, en la investigación y comprobación de conjeturas o problemas.",
        "saberes": [
            "MAT.3.C.1.3",
            "MAT.3.E.3.2"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "4.1",
        "descripcion": "Reconocer patrones en la resolución de problemas complejos, plantear procedimientos, organizar datos, utilizando la abstracción para identificar los aspectos más relevantes y descomponer un  problema en partes más simples facilitando su interpretación computacional y relacionando los aspectos fundamentales de la informática con las necesidades del alumnado.",
        "saberes": [
            "MAT.3.A.1.1",
            "MAT.3.A.4.4",
            "MAT.3.D.6.2",
            "MAT.3.D.6.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "4.2",
        "descripcion": "Modelizar situaciones de la vida cotidiana y resolver problemas de forma eficaz, interpretando y modificando algoritmos, creando modelos abstractos de situaciones cotidianas, para su automatización, modelización y codificación en un lenguaje fácil de interpretar por un sistema informático.",
        "saberes": [
            "MAT.3.C.4.1",
            "MAT.3.D.1.1",
            "MAT.3.D.2.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "5.1",
        "descripcion": "Reconocer y usar las relaciones entre los conocimientos y experiencias matemáticas de los bloques de saberes y de los distintos niveles formando un todo coherente, reconociendo y  utilizando las conexiones entre ideas matemáticas en la resolución de problemas.",
        "saberes": [
            "MAT.3.A.3.2",
            "MAT.3.C.1.2",
            "MAT.3.C.2",
            "MAT.3.E.1.5"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "5.2",
        "descripcion": "Realizar conexiones entre diferentes procesos matemáticos y comprender cómo unas ideas se construyen sobre otras, aplicando conocimientos y experiencias previas y enlazándolas con las nuevas ideas.",
        "saberes": [
            "MAT.3.A.2.5",
            "MAT.3.A.4.1",
            "MAT.3.C.3",
            "MAT.3.E.2.2"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "6.1",
        "descripcion": "Reconocer situaciones en diferentes contextos (personal, escolar, social, científico y humanístico) susceptibles de ser formuladas y resueltas mediante herramientas y estrategias matemáticas, estableciendo conexiones entre el mundo real y las matemáticas, usando los procesos  inherentes a la investigación científica y matemática: inferir, medir, comunicar, clasificar y predecir y aplicando distintos procedimientos en la resolución de problemas en situaciones diversas.",
        "saberes": [
            "MAT.3.A.1.2",
            "MAT.3.A.5.1",
            "MAT.3.A.5.2",
            "MAT.3.B.2.1",
            "MAT.3.B.2.2",
            "MAT.3.B.2.3",
            "MAT.3.C.1.1",
            "MAT.3.E.1.1",
            "MAT.3.E.2.3",
            "MAT.3.E.3.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "6.2",
        "descripcion": "Analizar conexiones coherentes entre ideas y conceptos matemáticos con otras materias y con la vida real y aplicarlas mediante el uso de distintos procedimientos en la resolución de problemas en situaciones diversas.",
        "saberes": [
            "MAT.3.A.6.1",
            "MAT.3.C.4.2",
            "MAT.3.D.2.2",
            "MAT.3.D.4.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "6.3",
        "descripcion": "Reconocer en diferentes contextos (personal, escolar, social, científico y humanístico) la aportación de las matemáticas al progreso de la humanidad y su contribución a la superación de los  retos que demanda la sociedad actual, identificando algunas aportaciones hechas desde nuestra comunidad.",
        "saberes": [
            "MAT.3.E.3.3",
            "MAT.3.F.3.2.",
            "MAT.3.F.3.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "7.1",
        "descripcion": "Representar conceptos, procedimientos, información y resultados matemáticos, usando diferentes herramientas digitales, seleccionando y configurando formas de representación adecuadas para visualizar ideas y estructurar procesos matemáticos, interpretando y resolviendo problemas de la vida real y valorando su utilidad para compartir información.",
        "saberes": [
            "MAT.3.A.2.4",
            "MAT.3.A.4.2",
            "MAT.3.E.1.2",
            "MAT.3.E.1.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "7.2",
        "descripcion": "Elaborar representaciones matemáticas utilizando herramientas de interpretación y modelización como diagramas, expresiones simbólicas o gráficas que ayuden a tomar decisiones razonadas en la búsqueda de estrategias de resolución de una situación problematizada.",
        "saberes": [
            "MAT.3.A.5.3",
            "MAT.3.E.1.4",
            "MAT.3.E.1.7"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "8.1",
        "descripcion": "Comunicar ideas, conceptos y procesos, seleccionando y utilizando el lenguaje matemático apropiado y empleando diferentes medios, incluidos los digitales, oralmente y por escrito, al describir, explicar y justificar razonamientos, procedimientos y conclusiones, de forma clara y precisa.",
        "saberes": [
            "MAT.3.D.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático presente en la vida cotidiana, expresando y comunicando mensajes con contenido matemático y  utilizando la terminología matemática más adecuada de forma clara, precisa, rigurosa y veraz.",
        "saberes": [
            "MAT.3.A.4.3",
            "MAT.3.D.5.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "9.1",
        "descripcion": "Gestionar las emociones propias y desarrollar el autoconcepto matemático como herramienta, generando expectativas positivas ante nuevos retos matemáticos, pensando de forma crítica y creativa, adaptándose ante la incertidumbre y reconociendo fuentes de estrés.",
        "saberes": [
            "MAT.3.F.1.1"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva, proactiva y perseverante, aceptando la crítica razonada, el error y las conclusiones de las autoevaluaciones como elementos necesarios para hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MAT.3.F.1.2",
            "MAT.3.F.1.3"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "10.1",
        "descripcion": "Colaborar activamente y construir relaciones saludables en el trabajo de las matemáticas en equipos heterogéneos, respetando diferentes opiniones, comunicándose de manera efectiva y empática, planificando e indagando con motivación y confianza en sus propias posibilidades, pensando de forma crítica y creativa y tomando decisiones y realizando juicios informados.",
        "saberes": [
            "MAT.3.F.2.1",
            "MAT.3.F.2.2"
        ]
    },
    {
        "nivel": "MAT3",
        "codigo": "10.2",
        "descripcion": "Participar en el reparto de tareas que deban desarrollarse en equipo, aportando valor, favoreciendo la inclusión, ejercitando la escucha activa, mostrando empatía por los demás, asumiendo el rol asignado, rompiendo con los estereotipos e ideas preconcebidas sobre las matemáticas asociadas a cuestiones individuales y responsabilizánd ose de la propia contribución al equipo.",
        "saberes": [
            "MAT.3.F.2.1",
            "MAT.3.F.3.1"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "1.1",
        "descripcion": "Reformular problemas matemáticos de forma verbal y gráfica, interpretando los datos, las relaciones entre ellos y las preguntas planteadas",
        "saberes": [
            "MAA.4.A.5",
            "MAA.4.A.6",
            "MAA.4.E.1.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "1.2",
        "descripcion": "Seleccionar herramientas y estrategias elaboradas para la resolución de problemas valorando su eficacia e idoneidad",
        "saberes": [
            "MAA.4.A.3.1",
            "MAA.4.D.3.2",
            "MAA.4.E.2.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "1.3",
        "descripcion": "Obtener todas las posibles soluciones matemáticas de un problema activando los conocimientos, analizando los resultados y reconociendo el error como parte del proceso, utilizando para ello las herramientas tecnológicas adecuadas.",
        "saberes": [
            "MAA.4.A.2.1",
            "MAA.4.A.3.2",
            "MAA.4.D.3.1",
            "MAA.4.D.4.2",
            "MAA.4.F.1.3"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "2.1",
        "descripcion": "Comprobar la corrección matemática de las soluciones de un problema.",
        "saberes": [
            "MAA.4.A.4.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "2.2",
        "descripcion": "Seleccionar las soluciones óptimas de un problema valorando tanto la corrección matemática como sus implicaciones desde diferentes perspectivas (de género, de sostenibilidad, de consumo responsable…)",
        "saberes": [
            "MAA.4.E.3.3",
            "MAA.4.F.3.1",
            "MAA.4.F.3.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "3.1",
        "descripcion": "Formular, comprobar e investigar conjeturas de forma guiada estudiando patrones, propiedades y relaciones.",
        "saberes": [
            "MAA.4.D.1",
            "MAA.4.D.4.3"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "3.2",
        "descripcion": "Crear variantes de un problema dado, modificando alguno de sus datos y observando la relación entre los diferentes resultados obtenidos.",
        "saberes": [
            "MAA.4.D.6.1"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "3.3",
        "descripcion": "Emplear herramientas tecnológicas adecuadas en la investigación y comprobación de conjeturas o problemas.",
        "saberes": [
            "MAA.4.B.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "4.1",
        "descripcion": "Reconocer e investigar patrones, organizar datos y descomponer un problema en partes más simples facilitando su interpretación y su tratamiento computacional.",
        "saberes": [
            "MAA.4.A.1",
            "MAA.4.A.4.1",
            "MAA.4.C.1",
            "MAA.4.D.6.2",
            "MAA.4.D.6.3"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "4.2",
        "descripcion": "Modelizar situaciones y resolver problemas de forma eficaz, interpretando, modificando y creando algoritmos sencillos.",
        "saberes": [
            "MAA.4.C.3.2",
            "MAA.4.D.2.1",
            "MAA.4.D.4.4",
            "MAA.4.E.1.5"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "5.1",
        "descripcion": "Deducir relaciones entre los conocimientos y experiencias matemáticas, formando un todo coherente.",
        "saberes": [
            "MAA.4.C.3.1"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "5.2",
        "descripcion": "Analizar y poner en práctica conexiones entre diferentes procesos matemáticos, aplicando conocimientos y experiencias previas.",
        "saberes": [
            "MAA.4.C.2",
            "MAA.4.D.5.1"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "6.1",
        "descripcion": "Proponer situaciones susceptibles de ser formuladas y resueltas mediante herramientas y estrategias matemáticas, estableciendo y aplicando conexiones entre el mundo real y las matemáticas, y usando los procesos inherentes a la investigación científica y matemática como inferir, medir, comunicar, clasificar y predecir.",
        "saberes": [
            "MAA.4.A.2.3",
            "MAA.4.B.1",
            "MAA.4.E.1.1",
            "MAA.4.E.2.1",
            "MAA.4.E.3.1."
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "6.2",
        "descripcion": "Identificar y aplicar conexiones coherentes entre las matemáticas y otras materias, realizando un análisis crítico de los contenidos.",
        "saberes": [
            "MAA.4.D.2.2",
            "MAA.4.D.4.1"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "6.3",
        "descripcion": "Valorar la aportación de las matemáticas al progreso de la humanidad y su contribución en la superación de los retos que demanda la sociedad actual, identificando algunas aportaciones hechas desde nuestra comunidad.",
        "saberes": [
            "MAA.4.C.3.3",
            "MAA.4.F.3.2",
            "MAA.4.F.3.3"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "7.1",
        "descripcion": "Representar matemáticamente la información más relevante de un problema, conceptos, procedimientos y resultados matemáticos, visualizando ideas y estructurando procesos matemáticos.",
        "saberes": [
            "MAA.4.E.1.3"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "7.2",
        "descripcion": "Seleccionar entre diferentes herramientas, incluidas las digitales, y formas de representación (pictórica, gráfica, verbal o simbólica) valorando su utilidad para compartir información.",
        "saberes": [
            "MAA.4.E.1.4"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "8.1",
        "descripcion": "Comunicar ideas, conclusiones, conjeturas y razonamientos matemáticos, utilizando diferentes medios, incluidos los digitales, empleando la terminología apropiada con coherencia y claridad.",
        "saberes": [
            "MAA.4.D.5.3",
            "MAA.4.E.3.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático presente en la vida cotidiana y en diversos contextos comunicando mensajes con contenido matemático con precisión y rigor.",
        "saberes": [
            "MAA.4.A.2.2",
            "MAA.4.A.3.3",
            "MAA.4.D.5.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "9.1",
        "descripcion": "Identificar y gestionar las emociones propias y desarrollar el autoconcepto matemático generando expectativas positivas ante nuevos retos matemáticos.",
        "saberes": [
            "MAA.4.F.1.1"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando la crítica razonada al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MAA.4.F.1.2",
            "MAA.4.F.1.3"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "10.1",
        "descripcion": "Colaborar activamente y construir relaciones trabajando con las matemáticas en equipos heterogéneos, respetando diferentes opiniones, comunicándose de manera efectiva, pensando de forma crítica y creativa, tomando decisiones y realizando juicios informados.",
        "saberes": [
            "MAA.4.F.2.1",
            "MAA.4.F.2.2"
        ]
    },
    {
        "nivel": "MAA",
        "codigo": "10.2",
        "descripcion": "Gestionar el reparto de tareas en el trabajo en equipo, aportando valor, favoreciendo la inclusión, la escucha activa, responsabilizándose del rol asignado y de la propia contribución al equipo.",
        "saberes": [
            "MAA.4.F.2.1",
            "MAA.4.F.3.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "1.1",
        "descripcion": "Reformular de forma verbal y gráfica problemas matemáticos, interpretando los datos, las relaciones entre ellos y las preguntas planteadas.",
        "saberes": [
            "MAB.4.A.1.3",
            "MAB.4.A.4",
            "MAB.4.B.1",
            "MAB.4.E.1.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "1.2",
        "descripcion": "Analizar y seleccionar diferentes herramientas y estrategias elaboradas en la resolución de un mismo problema, valorando su eficiencia.",
        "saberes": [
            "MAB.4.D.3.1",
            "MAB.4.D.3.2",
            "MAB.4.D.4.2",
            "MAB.4.E.2.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "1.3",
        "descripcion": "Obtener todas las posibles soluciones matemáticas de un problema, movilizando los conocimientos necesarios, analizando los resultados y reconociendo el error como parte del proceso. Utilizando para ello las herramientas tecnológicas adecuadas.",
        "saberes": [
            "MAB.4.A.1.1",
            "MAB.4.A.2.1",
            "MAB.4.A.2.2",
            "MAB.4.F.1.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "2.1",
        "descripcion": "Comprobar la corrección matemática de las soluciones de un problema.",
        "saberes": [
            "MAB.4.A.3.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "2.2",
        "descripcion": "Justificar las soluciones óptimas de un problema, evaluándolas desde diferentes perspectivas (matemática, de género, de sostenibilidad, de consumo responsable, etc.).",
        "saberes": [
            "MAB.4.E.3.3",
            "MAB.4.F.3.1",
            "MAB.4.F.3.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "3.1",
        "descripcion": "Formular, comprobar e investigar conjeturas de forma guiada.",
        "saberes": [
            "MAB.4.C.2.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "3.2",
        "descripcion": "Plantear variantes de un problema dado que lleven a una generalización.",
        "saberes": [
            "MAB.4.D.6.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "3.3",
        "descripcion": "Emplear herramientas tecnológicas adecuadas en la investigación y comprobación de conjeturas o problemas.",
        "saberes": [
            "MAB.4.B.2",
            "MAB.4.C.1",
            "MAB.4.C.2.1",
            "MAB.4.D.4.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "4.1",
        "descripcion": "Generalizar patrones de situaciones problematizadas, proporcionando una representación computacional.",
        "saberes": [
            "MAB.4.D.1",
            "MAB.4.D.6.2",
            "MAB.4.D.6.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "4.2",
        "descripcion": "Modelizar situaciones y resolver problemas de forma eficaz, interpretando, modificando, generalizando y creando algoritmos.",
        "saberes": [
            "MAB.4.C.4.2",
            "MAB.4.D.2.1",
            "AB.4.D.4.4",
            "MAB.4.E.1.5"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "5.1",
        "descripcion": "Deducir relaciones entre los conocimientos y experiencias matemáticas, formando un todo coherente.",
        "saberes": [
            "MAB.4.C.4.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "5.2",
        "descripcion": "Analizar y poner en práctica conexiones entre diferentes procesos matemáticos aplicando conocimientos y experiencias previas.",
        "saberes": [
            "MAB.4.C.3",
            "MAB.4.D.5.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "6.1",
        "descripcion": "Proponer situaciones susceptibles de ser formuladas y resueltas mediante herramientas y estrategias matemáticas, estableciendo y aplicando conexiones entre el mundo real y las matemáticas, y usando los procesos inherentes a la investigación científica y matemática como inferir, medir, comunicar, clasificar y predecir.",
        "saberes": [
            "MAB.4.E.1.1",
            "MAB.4.E.2.1",
            "MAB.4.E.3.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "6.2",
        "descripcion": "Analizar y aplicar conexiones coherentes entre las matemáticas y otras materias realizando un análisis crítico.",
        "saberes": [
            "MAB.4.D.2.2",
            "MAB.4.D.4.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "6.3",
        "descripcion": "Valorar la aportación de las matemáticas al progreso de la humanidad y su contribución a la superación de los retos que demanda la sociedad actual, identificando algunas aportaciones hechas desde nuestra comunidad.",
        "saberes": [
            "MAB.4.C.4.3",
            "MAB.4.F.3.2",
            "MAB.4.F.3.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "7.1",
        "descripcion": "Representar matemáticamente la información más relevante de un problema, conceptos, procedimientos y resultados matemáticos, usando diferentes herramientas visualizando ideas y estructurar procesos matemáticos.",
        "saberes": [
            "MAB.4.A.3.1",
            "MAB.4.D.5.2",
            "MAB.4.E.1.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "7.2",
        "descripcion": "Seleccionar y entre diferentes herramientas, incluidas las digitales, y formas de representación pictórica, gráfica, verbal o simbólica, valorando su utilidad para compartir información.",
        "saberes": [
            "MAB.4.E.1.4"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "8.1",
        "descripcion": "Comunicar ideas, procedimientos, conclusiones, conjeturas y razonamientos matemáticos, utilizando diferentes medios, incluidos los digitales, empleando la terminología apropiada con coherencia y claridad.",
        "saberes": [
            "MAB.4.E.3.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático presente en la vida cotidiana y en diversos contextos comunicando mensajes con contenido matemático con precisión y rigor.",
        "saberes": [
            "MAB.4.A.1.2",
            "MAB.4.A.2.3",
            "MAB.4.D.5.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "9.1",
        "descripcion": "Identificar y gestionar las emociones propias y desarrollar el autoconcepto matemático, generando expectativas positivas ante nuevos retos matemáticos.",
        "saberes": [
            "MAB.4.F.1.1"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando la crítica razonada al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MAB.4.F.1.2",
            "MAB.4.F.1.3"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "10.1",
        "descripcion": "Colaborar activamente y construir relaciones trabajando con las matemáticas en equipos heterogéneos, respetando diferentes opiniones, comunicándose de manera efectiva, pensando de forma crítica y creativa, tomando decisiones y realizando juicios informados.",
        "saberes": [
            "MAB.4.F.2.1",
            "MAB.4.F.2.2"
        ]
    },
    {
        "nivel": "MAB",
        "codigo": "10.2",
        "descripcion": "Gestionar el reparto de tareas en el trabajo en equipo, aportando valor, favoreciendo la inclusión, la escucha activa, responsabilizándose del rol asignado y de la propia contribución al equipo.",
        "saberes": [
            "MAB.4.F.2.1",
            "MAB.4.F.3.1"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "1.1",
        "descripcion": "Manejar algunas estrategias y herramientas, incluidas las digitales, en la modelización y resolución de problemas de la vida cotidiana y de la ciencia y la tecnología, evaluando su eficiencia en cada caso.",
        "saberes": [
            "MATE.1.A.1.1",
            "MATE.1.A.2.1",
            "MATE.1.C.2.2",
            "MATE.1.C.3.2",
            "MATE.1.C.3.4",
            "MATE.1.D.2.2",
            "MATE.1.E.1.4"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "1.2",
        "descripcion": "Obtener todas las posibles soluciones matemáticas de problemas de la vida cotidiana y de la ciencia y la tecnología, utilizando la estrategia de resolución más apropiada y describiendo el procedimiento utilizado.",
        "saberes": [
            "MATE.1.A.1.2",
            "MATE.1.A.2.2",
            "MATE.1.B.2.1",
            "MATE.1.C.1.2",
            "MATE.1.D.3"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "2.1",
        "descripcion": "Comprobar la validez matemática de las posibles soluciones de un problema e interpretarlas, utilizando el razonamiento y la argumentación.",
        "saberes": [
            "MATE.1.A.1.1",
            "MATE.1.A.1.2",
            "MATE.1.B.1.1",
            "MATE.1.D.3"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "2.2",
        "descripcion": "Seleccionar la solución más adecuada de un problema en función del contexto -de sostenibilidad, de consumo responsable, de equidad, etc-, usando el razonamiento y la argumentación.",
        "saberes": [
            "MATE.1.A.2.1",
            "MATE.1.C.2.2",
            "MATE.1.D.5.1"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "3.1",
        "descripcion": "Adquirir nuevo conocimiento matemático a partir de la formulación de conjeturas y de la formulación y reformulación de problemas de forma guiada.",
        "saberes": [
            "MATE.1.B.1.2",
            "MATE.1.C.3.3",
            "MATE.1.D.1",
            "MATE.1.D.5.2"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "3.2",
        "descripcion": "Emplear herramientas tecnológicas adecuadas en la formulación o investigación de conjeturas o problemas.",
        "saberes": [
            "MATE.1.C.2.1",
            "MATE.1.C.3.1",
            "MATE.1.D.1",
            "MATE.1.D.4.",
            "MATE.1.D.5.1",
            "MATE.1.E.1.4",
            "MATE.1.E.3"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "4.1",
        "descripcion": "Interpretar y modelizar y resolver situaciones problematizadas de la vida cotidiana y de la ciencia y la tecnología, utilizando el pensamiento computacional, modificando, creando y generalizando algoritmos, y en su caso, implementándolos en un sistema informático.",
        "saberes": [
            "MATE.1.D.1",
            "MATE.1.D.5.1",
            "MATE.1.D.5.2",
            "MATE.1.F.2.1"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "5.1",
        "descripcion": "Manifestar una visión matemática integrada, investigando y conectando las diferentes ideas matemáticas.",
        "saberes": [
            "MATE.1.B.2.1",
            "MATE.1.B.2.2",
            "MATE.1.B.2.3",
            "MATE.1.C.2.1",
            "MATE.1.C.3.4",
            "MATE.1.D.4.2"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "5.2",
        "descripcion": "Resolver problemas en contextos matemáticos, estableciendo y aplicando conexiones entre las diferentes ideas matemáticas y usando enfoques diferentes.",
        "saberes": [
            "MATE.1.B.2.2",
            "MATE.1.B.2.3",
            "MATE.1.C.1.2",
            "MATE.1.D.2.1"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "6.1",
        "descripcion": "Resolver problemas en situaciones diversas utilizando procesos matemáticos, estableciendo y aplicando conexiones entre el mundo real, otras áreas de conocimiento y las matemáticas.",
        "saberes": [
            "MATE.1.B.1.1",
            "MATE.1.C.3.2",
            "MATE.1.D.2.1",
            "MATE.1.E.2.1",
            "MATE.1.E.2.2"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "6.2",
        "descripcion": "Analizar la aportación de las matemáticas al progreso de la humanidad, reflexionando sobre su contribución en la propuesta de soluciones a situaciones complejas: consumo responsable, medio ambiente, sostenibilidad, etc., y a los retos científicos y tecnológicos que se plantean en la sociedad.",
        "saberes": [
            "MATE.1.B.2.3",
            "MATE.1.C.3.2",
            "MATE.1.C.3.5",
            "MATE.1.F.3.2"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "7.1",
        "descripcion": "Representar ideas matemáticas, estructurando diferentes razonamientos matemáticos y seleccionando las tecnologías más adecuadas.",
        "saberes": [
            "MATE.1.A.2.2",
            "MATE.1.B.1.2",
            "MATE.1.C.1.1",
            "MATE.1.C.3.1",
            "MATE.1.D.4.2",
            "MATE.1.E.1.4"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "7.2",
        "descripcion": "Seleccionar y utilizar diversas formas de representación, valorando su utilidad para compartir información.",
        "saberes": [
            "MATE.1.C.2.1",
            "MATE.1.D.4.1",
            "MATE.1.D.4.3",
            "MATE.1.E.1.1",
            "MATE.1.E.1.2",
            "MATE.1.E.1.3"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "8.1",
        "descripcion": "Mostrar organización al comunicar las ideas matemáticas, empleando el soporte, la terminología y el rigor apropiados.",
        "saberes": [
            "MATE.1.B.1.2",
            "MATE.1.D.4.3",
            "MATE.1.E.1.1",
            "MATE.1.E.1.2",
            "MATE.1.E.1.3",
            "MATE.1.E.3",
            "MATE.1.F.3.1"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático en diferentes contextos, comunicando la información con precisión y rigor.",
        "saberes": [
            "MATE.1.C.3.5",
            "MATE.1.D.4.3",
            "MATE.1.E.2.1",
            "MATE.1.E.2.2"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "9.1",
        "descripcion": "Afrontar las situaciones de incertidumbre, identificando y gestionando emociones y aceptando y aprendiendo del error como parte del proceso de aprendizaje de las matemáticas.",
        "saberes": [
            "MATE.1.F.1.1",
            "MATE.1.F.1.2"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando y aprendiendo de la crítica razonada al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MATE.1.F.2.1",
            "MATE.1.F.3.1"
        ]
    },
    {
        "nivel": "MATE1",
        "codigo": "9.3",
        "descripcion": "Participar en tareas matemáticas de forma activa en equipos heterogéneos, respetando las emociones y experiencias de las y los demás y escuchando su razonamiento, identificando las habilidades sociales más propicias y fomentando el bienestar grupal y las relaciones saludables.",
        "saberes": [
            "MATE.1.F.1.2",
            "MATE.1.F.2.2",
            "MATE.1.F.3.1"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "1.1",
        "descripcion": "Manejar diferentes estrategias y herramientas, incluidas las digitales, que modelizan y resuelven problemas de la vida cotidiana y de la ciencia y tecnología, seleccionando las más adecuadas según su eficiencia.",
        "saberes": [
            "MATE.2.A.1.1",
            "MATE.2.B.1.1",
            "MATE.2.B.1.3",
            "MATE.2.C.3.2",
            "MATE.2.C.3.4",
            "MATE.2.D.2.2",
            "MATE.2.E.2.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "1.2",
        "descripcion": "Obtener todas las posibles soluciones matemáticas de problemas de la vida cotidiana y de la ciencia y la tecnología, usando la estrategia de resolución más apropiada y describiendo el procedimiento utilizado.",
        "saberes": [
            "MATE.2.A.1.2",
            "MATE.2.A.2",
            "MATE.2.C.1.2",
            "MATE.2.D.2.3",
            "MATE.2.D.3.2",
            "MATE.2.D.5.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "2.1",
        "descripcion": "Demostrar la validez matemática de las posibles soluciones de un problema e interpretarlas, utilizando el razonamiento y la argumentación.",
        "saberes": [
            "MATE.2.A.1.1",
            "MATE.2.A.1.2",
            "MATE.2.B.1.3",
            "MATE.2.B.1.4",
            "MATE.2.C.3.3",
            "MATE.2.D.3.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "2.2",
        "descripcion": "Seleccionar la solución más adecuada de un problema en función del contexto -de sostenibilidad, de consumo responsable, de equidad, etc.-, usando el razonamiento y la argumentación.",
        "saberes": [
            "MATE.2.C.2.2",
            "MATE.2.D.5.1"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "3.1",
        "descripcion": "Adquirir nuevo conocimiento matemático mediante la formulación, razonamiento y justificación de conjeturas y de la formulación y reformulación de problemas de forma autónoma.",
        "saberes": [
            "MATE.2.B.1.2",
            "MATE.2.B.1.5",
            "MATE.2.B.2.1",
            "MATE.2.C.3.3",
            "MATE.2.D.1",
            "MATE.2.E.1.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "3.2",
        "descripcion": "Integrar el uso de herramientas tecnológicas en la formulación o investigación de conjeturas y problemas.",
        "saberes": [
            "MATE.2.C.2.1",
            "MATE.2.C.3.1",
            "MATE.2.D.1",
            "MATE.2.D.3.1",
            "MATE.2.D.4.1",
            "MATE.2.D.5.1"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "4.1",
        "descripcion": "Interpretar, modelizar y resolver situaciones problematizadas de la vida cotidiana y de la ciencia y la tecnología utilizando el pensamiento computacional, modificando, creando y generalizando algoritmos, y en su caso, implementándolos en un sistema informático.",
        "saberes": [
            "MATE.2.D.1",
            "MATE.2.D.5.1",
            "MATE.2.D.5.2",
            "MATE.2.F.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "5.1",
        "descripcion": "Demostrar una visión matemática integrada, investigando y conectando las diferentes ideas matemáticas.",
        "saberes": [
            "MATE.2.B.1.2",
            "MATE.2.B.2.2",
            "MATE.2.C.2.1",
            "MATE.2.C.2.2",
            "MATE.2.D.2.1",
            "MATE.2.D.2.3",
            "MATE.2.D.4.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "5.2",
        "descripcion": "Resolver problemas en contextos matemáticos, estableciendo aplicando conexiones entre las diferentes ideas matemáticas y usando diferentes enfoques.",
        "saberes": [
            "MATE.2.B.1.1",
            "MATE.2.B.1.4",
            "MATE.2.B.2.1",
            "MATE.2.B.2.3",
            "MATE.2.C.1.2",
            "MATE.2.C.3.4"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "6.1",
        "descripcion": "Resolver problemas en situaciones diversas utilizando procesos matemáticos, reflexionando, estableciendo y aplicando conexiones entre el mundo real, otras áreas de conocimiento y las matemáticas.",
        "saberes": [
            "MATE.2.C.3.2",
            "MATE.2.D.2.1",
            "MATE.2.D.2.3",
            "MATE.2.E.1.1",
            "MATE.2.E.1.2",
            "MATE.2.E.2.1"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "6.2",
        "descripcion": "Analizar la aportación de las matemáticas al progreso de la humanidad, valorando su contribución en la propuesta de soluciones a situaciones complejas: consumo responsable, medio ambiente, sostenibilidad, etc., y a los retos científicos y tecnológicos que se plantean en la sociedad.",
        "saberes": [
            "MATE.2.B.1.4",
            "MATE.2.B.2.3",
            "MATE.2.C.3.2",
            "MATE.2.C.3.5",
            "MATE.2.E.2.2",
            "MATE.2.F.3.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "7.1",
        "descripcion": "Representar ideas matemáticas, estructurando diferentes razonamientos matemáticos y seleccionando las tecnologías más adecuadas.",
        "saberes": [
            "MATE.2.A.2",
            "MATE.2.B.1.2",
            "MATE.2.B.1.5",
            "MATE.2.B.2.1",
            "MATE.2.C.1.1",
            "MATE.2.C.2.1",
            "MATE.2.C.3.1",
            "MATE.2.D.4.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "7.2",
        "descripcion": "Seleccionar y utilizar diversas formas de representación, valorando su utilidad para compartir información.",
        "saberes": [
            "MATE.2.B.2.2",
            "MATE.2.C.3.1",
            "MATE.2.D.4.1"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "8.1",
        "descripcion": "Mostrar organización al comunicar las ideas matemáticas, empleando el soporte, la terminología y el rigor apropiados.",
        "saberes": [
            "MATE.2.B.1.5",
            "MATE.2.C.2.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático en diferentes contextos, comunicando la información con precisión y rigor.",
        "saberes": [
            "MATE.2.C.3.5",
            "MATE.2.E.1.1",
            "MATE.2.E.1.2",
            "MATE.2.E.2.1",
            "MATE.2.E.2.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "9.1",
        "descripcion": "Afrontar las situaciones de incertidumbre y tomar decisiones, evaluando distintas opciones, identificando y gestionando emociones y aceptando y aprendiendo del error como parte del proceso de aprendizaje de las matemáticas.",
        "saberes": [
            "MATE.2.F.1.1",
            "MATE.2.F.1.2"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando y aprendiendo de la crítica razonada al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MATE.2.F.2",
            "MATE.2.F.3.1"
        ]
    },
    {
        "nivel": "MATE2",
        "codigo": "9.3",
        "descripcion": "Trabajar en tareas matemáticas de forma activa en equipos heterogéneos, respetando las emociones y experiencias de las y los demás y escuchando su razonamiento, aplicando las habilidades sociales más propicias y fomentando el bienestar del equipo y las relaciones saludables.",
        "saberes": [
            "MATE.2.F.1.2",
            "MATE.2.F.3.1"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "1.1",
        "descripcion": "Emplear algunas estrategias y herramientas, incluidas las digitales, en la resolución de problemas de la vida cotidiana y de las ciencias sociales, valorando su eficiencia en cada caso.",
        "saberes": [
            "MACS.1.A.1",
            "MACS.1.A.4",
            "MACS.1.B.1",
            "MACS.1.C.2.2",
            "MACS.1.D 1.7",
            "MACS.1.D.3.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "1.2",
        "descripcion": "Obtener todas las posibles soluciones matemáticas de problemas de la vida cotidiana y de las ciencias sociales, usando la estrategia de resolución más apropiada y describiendo el procedimiento realizado.",
        "saberes": [
            "MACS.1.A.1",
            "MACS.1.A.2",
            "MACS.1.A.3",
            "MACS.1.C.3"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "2.1",
        "descripcion": "Comprobar la validez matemática de las posibles soluciones de un problema e interpretarlas, utilizando el razonamiento y la argumentación.",
        "saberes": [
            "MACS.1.A.1",
            "MACS.1.A.2",
            "MACS.1.A.3",
            "MACS.1.C.3"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "2.2",
        "descripcion": "Seleccionar la solución más adecuada de un problema en función del contexto: de sostenibilidad, de consumo responsable, de equidad, etc., usando el razonamiento y la argumentación.",
        "saberes": [
            "MACS.1.C.5.1",
            "MACS.1.C.5.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "3.1",
        "descripcion": "Adquirir nuevo conocimiento matemático mediante la formulación de conjeturas y de la formulación y reformulación de problemas de forma guiada.",
        "saberes": [
            "MACS.1.C.1",
            "MACS.1.C.5.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "3.2",
        "descripcion": "Emplear herramientas tecnológicas adecuadas en la formulación o investigación de conjeturas o problemas.",
        "saberes": [
            "MACS.1.C.1",
            "MACS.1.C.4.1",
            "MACS.1.C.5.1",
            "MACS.1.D 1.7",
            "MACS.1.D.4.1",
            "MACS.1.D.4.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "4.1",
        "descripcion": "Interpretar, modelizar y resolver situaciones problematizadas de la vida cotidiana y de las ciencias sociales, utilizando el pensamiento computacional, modificando, creando y generalizando algoritmos.",
        "saberes": [
            "MACS.1.C.1",
            "MACS.1.C.5.1",
            "MACS.1.C.5.2",
            "MACS.1.E.2.1"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "5.1",
        "descripcion": "Manifestar una visión matemática integrada, investigando y conectando las diferentes ideas matemáticas.",
        "saberes": [
            "MACS.1.B.1",
            "MACS.1.C.4.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "5.2",
        "descripcion": "Resolver problemas, estableciendo y aplicando conexiones entre las diferentes ideas matemáticas.",
        "saberes": [
            "MACS.1.C.2.1",
            "MACS.1.C.2.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "6.1",
        "descripcion": "Resolver problemas en situaciones diversas, utilizando procesos matemáticos, estableciendo y aplicando conexiones entre el mundo real, otras áreas de conocimiento y las matemáticas.",
        "saberes": [
            "MACS.1.A.4",
            "MACS.1.C 2.1",
            "MACS.1.D.2.1",
            "MACS.1.D.2.2",
            "MACS.1.D.3.1"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "6.2",
        "descripcion": "Analizar la aportación de las matemáticas al progreso de la humanidad, reflexionando sobre su contribución en la propuesta de soluciones a situaciones complejas y a los retos en las ciencias sociales que se plantean.",
        "saberes": [
            "MACS.1.B.1",
            "MACS.1.D.3.2",
            "MACS.1.D.3.3",
            "MACS.1.E.3.1",
            "MACS.1.E.3.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "7.1",
        "descripcion": "Representar ideas matemáticas, estructurando diferentes razonamientos matemáticos y seleccionando las tecnologías más adecuadas.",
        "saberes": [
            "MACS.1.B.2.1",
            "MACS.1.B.2.2",
            "MACS.1.B.2.3",
            "MACS.1.C.4.2",
            "MACS.1.D 1.7"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "7.2",
        "descripcion": "Seleccionar y utilizar diversas formas de representación, valorando su utilidad para compartir información.",
        "saberes": [
            "MACS.1.C.4.1",
            "MACS.1.C.4.3",
            "MACS.1.D 1.1",
            "MACS.1.D 1.2",
            "MACS.1.D 1.3",
            "MACS.1.D 1.4",
            "MACS.1.D.1.5",
            "MACS.1.D.1.6"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "8.1",
        "descripcion": "Mostrar organización al comunicar las ideas matemáticas, empleando el soporte, la terminología y el rigor apropiados.",
        "saberes": [
            "MACS.1.C.4.3",
            "MACS.1.D 1.1",
            "MACS.1.D 1.2",
            "MACS.1.D 1.3",
            "MACS.1.D 1.4",
            "MACS.1.D.1.5",
            "MACS.1.D.1.6",
            "MACS.1.D.4.1",
            "MACS.1.D.4.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático en diferentes contextos, comunicando la información con precisión y rigor.",
        "saberes": [
            "MACS.1.C.4.3",
            "MACS.1.D.2.1",
            "MACS.1.D.2.2",
            "MACS.1.D.3.1",
            "MACS.1.D.3.2",
            "MACS.1.D.3.3"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "9.1",
        "descripcion": "Afrontar las situaciones de incertidumbre, identificando y gestionando emociones y aceptando y aprendiendo del error como parte del proceso de aprendizaje de las matemáticas.",
        "saberes": [
            "MACS.1.E.1.1",
            "MACS.1.E.1.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "9.2",
        "descripcion": "Mostrar una actitud positiva y perseverante, aceptando y aprendiendo de la crítica razonada al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MACS.1.E.2.1",
            "MACS.1.E.2.2"
        ]
    },
    {
        "nivel": "MACS1",
        "codigo": "9.3",
        "descripcion": "Participar en tareas matemáticas de forma activa en equipos heterogéneos, respetando las emociones y experiencias de las y los demás, escuchando su razonamiento, identificando las habilidades sociales más propicias y fomentando el bienestar grupal y las relaciones saludables.",
        "saberes": [
            "MACS.1.E.1.2",
            "MACS.1.E.2.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "1.1",
        "descripcion": "Emplear diferentes estrategias y herramientas, incluidas las digitales que resuelvan problemas de la vida cotidiana y de las ciencias sociales, seleccionando la más adecuada según su eficiencia.",
        "saberes": [
            "MACS.2.A.1.1",
            "MACS.2.A.2",
            "MACS.2.B.1.2",
            "MACS.2.C.2.2",
            "MACS.2.D.2.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "1.2",
        "descripcion": "Obtener todas las posibles soluciones matemáticas de problemas de la vida cotidiana y de las ciencias sociales, usando la estrategia de resolución más apropiada y describiendo el procedimiento realizado.",
        "saberes": [
            "MACS.2.A.1.2",
            "MACS.2.A.1.3",
            "MACS.2.C.2.3",
            "MACS.2.C.3.2",
            "MACS.2.C.5.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "2.1",
        "descripcion": "Demostrar la validez matemática de las posibles soluciones de un problema e interpretarlas utilizando el razonamiento y la argumentación.",
        "saberes": [
            "MACS.2.A.1.3",
            "MACS.2.B.1.2",
            "MACS.2.C.3.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "2.2",
        "descripcion": "Seleccionar la solución más adecuada de un problema en función del contexto: de sostenibilidad, de consumo responsable, de equidad, etc., usando el razonamiento y la argumentación.",
        "saberes": [
            "MACS.2.B.1.3",
            "MACS.2.C.5.1"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "3.1",
        "descripcion": "Adquirir nuevo conocimiento matemático mediante la formulación, razonamiento y justificación de conjeturas y problemas de forma autónoma.",
        "saberes": [
            "MACS.2.B.1.1",
            "MACS.2.C.1"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "3.2",
        "descripcion": "Integrar el uso de herramientas tecnológicas en la formulación o investigación de conjeturas y problemas.",
        "saberes": [
            "MACS.2.C.1.1",
            "MACS.2.C.3.1",
            "MACS.2.C.4.1",
            "MACS.2.C.5.1"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "4.1",
        "descripcion": "Interpretar, modelizar y resolver situaciones problematizadas de la vida cotidiana y las ciencias sociales utilizando el pensamiento computacional, modificando, creando y generalizando algoritmos.",
        "saberes": [
            "MACS.2.A.1.4",
            "MACS.2.A.2",
            "MACS.2.C.1",
            "MACS.2.C.5.1",
            "MACS.2.C.5.2",
            "MACS.2.E.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "5.1",
        "descripcion": "Manifestar una visión matemática integrada, investigando y conectando las diferentes ideas matemáticas.",
        "saberes": [
            "MACS.2.B.1.1",
            "MACS.2.B.2.2",
            "MACS.2.C.2.1",
            "MACS.2.C.2.3",
            "MACS.2.C.4.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "6.1",
        "descripcion": "Resolver problemas en situaciones diversas, utilizando procesos matemáticos, reflexionando, estableciendo y aplicando conexiones entre el mundo real, otras áreas de conocimiento y las matemáticas.",
        "saberes": [
            "MACS.2.C.2.1",
            "MACS.2.C.2.3",
            "MACS.2.C.2.4",
            "MACS.2.D.1.1",
            "MACS.2.D.1.2",
            "MACS.2.D.2.1",
            "MACS.2.D.3.1",
            "MACS.2.D.3.2",
            "MACS.2.D.3.3"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "6.2",
        "descripcion": "Analizar la aportación de las matemáticas al progreso de la humanidad, valorando su contribución en la propuesta de soluciones a situaciones complejas y a los retos que se plantean en las ciencias sociales.",
        "saberes": [
            "MACS.2.B 2.1",
            "MACS.2.D 2.2",
            "MACS.2.E.3.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "7.1",
        "descripcion": "Representar y visualizar ideas matemáticas, estructurando diferentes procesos matemáticos y seleccionando las tecnologías más adecuadas.",
        "saberes": [
            "MACS.2.B.1.1",
            "MACS.2.B.1.3",
            "MACS.2.C.4.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "7.2",
        "descripcion": "Seleccionar y utilizar diversas formas de representación, valorando su utilidad para compartir información.",
        "saberes": [
            "MACS.2.B.2.2",
            "MACS.2.C.4.1"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "8.1",
        "descripcion": "Mostrar organización al comunicar las ideas matemáticas, empleando el soporte, la terminología y el rigor apropiados.",
        "saberes": [
            "MACS.2.B.1.3",
            "MACS.2.D.1.1"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "8.2",
        "descripcion": "Reconocer y emplear el lenguaje matemático en diferentes contextos, comunicando la información con precisión y rigor.",
        "saberes": [
            "MACS.2.D.1.1",
            "MACS.2.D.1.2",
            "MACS.2.D.2.1",
            "MACS.2.D.2.2",
            "MACS.2.D.3.1",
            "MACS.2.D.3.2",
            "MACS.2.D.3.3",
            "MACS.2.D.3.4"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "9.1",
        "descripcion": "Afrontar las situaciones de incertidumbre y tomar decisiones evaluando distintas opciones, identificando y gestionando emociones, y aceptando y aprendiendo del error como parte del proceso de aprendizaje de las matemáticas.",
        "saberes": [
            "MACS.2.E.1.1",
            "MACS.2.E.1.2"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "9.2",
        "descripcion": "Mostrar perseverancia y una motivación positiva, aceptando y aprendiendo de la crítica razonada, al hacer frente a las diferentes situaciones de aprendizaje de las matemáticas.",
        "saberes": [
            "MACS.2.E.2",
            "MACS.2.E.3.1"
        ]
    },
    {
        "nivel": "MACS2",
        "codigo": "9.3",
        "descripcion": "Trabajar en tareas matemáticas de forma activa en equipos heterogéneos, respetando las emociones y experiencias de las y los demás y escuchando su razonamiento, aplicando las habilidades sociales más propicias y fomentando el bienestar del equipo y las relaciones saludables.",
        "saberes": [
            "MACS.2.E.1.2",
            "MACS.2.E.3.1"
        ]
    }
]