[
    {
        "etapa": "ESO",
        "descripcion": "Asumir responsablemente sus deberes, conocer y ejercer sus derechos en el respeto a las demás personas, practicar la tolerancia, la cooperación y la solidaridad entre las personas y grupos, ejercitarse en el diálogo afianzando los derechos humanos como valores comunes de una sociedad plural y prepararse para el ejercicio de la ciudadanía democrática."
    },
    {
        "etapa": "ESO",
        "descripcion": "Desarrollar y consolidar hábitos de disciplina, estudio y trabajo individual y en equipo como condición necesaria para una realización eficaz de las tareas del aprendizaje y como medio de desarrollo personal."
    },
    {
        "etapa": "ESO",
        "descripcion": "Valorar y respetar la diferencia de sexos y la igualdad de derechos y oportunidades entre ellos. Rechazar los estereotipos que supongan discriminación entre hombres y mujeres."
    },
    {
        "etapa": "ESO",
        "descripcion": "Fortalecer sus capacidades afectivas en todos los ámbitos de la personalidad y en sus relaciones con los demás, así como rechazar la violencia, los prejuicios de cualquier tipo, los comportamientos sexistas y resolver pacíficamente los conflictos."
    },
    {
        "etapa": "ESO",
        "descripcion": "Desarrollar destrezas básicas en la utilización de las fuentes de información para, con sentido crítico, adquirir nuevos conocimientos. Desarrollar las competencias tecnológicas básicas y avanzar en una reflexión ética sobre su funcionamiento y utilización."
    },
    {
        "etapa": "ESO",
        "descripcion": "Concebir el conocimiento científico como un saber integrado, que se estructura en distintas disciplinas, así como conocer y aplicar los métodos para identificar los problemas en los diversos campos del conocimiento y de la experiencia."
    },
    {
        "etapa": "ESO",
        "descripcion": "Desarrollar el espíritu emprendedor y la confianza en sí mismo, la participación, el sentido crítico, la iniciativa personal y la capacidad para aprender a aprender, planificar, tomar decisiones y asumir responsabilidades."
    },
    {
        "etapa": "ESO",
        "descripcion": "Comprender y expresar con corrección, oralmente y por escrito, en la lengua castellana, textos y mensajes complejos, e iniciarse en el conocimiento, la lectura y el estudio de la literatura."
    },
    {
        "etapa": "ESO",
        "descripcion": "Comprender y expresarse en una o más lenguas extranjeras de manera apropiada."
    },
    {
        "etapa": "ESO",
        "descripcion": "Conocer, valorar y respetar los aspectos básicos de la cultura y la historia propia y de las demás personas, apreciando los elementos específicos de la historia y la cultura andaluza, así como otros hechos diferenciadores como el flamenco, para que sean conocidos, valorados y respetados como patrimonio propio."
    },
    {
        "etapa": "ESO",
        "descripcion": "Conocer y aceptar el funcionamiento del propio cuerpo y el de las otras personas, respetar las diferencias, afianzar los hábitos de cuidado y salud corporales e incorporar la educación física y la práctica del deporte para favorecer el desarrollo personal y social. Conocer y valorar la dimensión humana de la sexualidad en toda su diversidad. Valorar críticamente los hábitos sociales relacionados con la salud, el consumo, el cuidado, la empatía y el respeto hacia los seres vivos, especialmente los animales y el medioambiente, contribuyendo a su conservación y mejora, reconociendo la riqueza paisajística y medioambiental andaluza."
    },
    {
        "etapa": "ESO",
        "descripcion": "Apreciar la creación artística y comprender el lenguaje de las distintas manifestaciones artísticas, utilizando diversos medios de expresión y representación."
    },
    {
        "etapa": "ESO",
        "descripcion": "Conocer y apreciar la peculiaridad lingüística andaluza en todas sus variedades."
    },
    {
        "etapa": "ESO",
        "descripcion": "Conocer y respetar el patrimonio cultural de Andalucía, partiendo del conocimiento y de la comprensión de nuestra cultura, reconociendo a Andalucía como comunidad de encuentro de culturas."
    },
    {
        "etapa": "BACH",
        "descripcion": "Ejercer la ciudadanía democrática, desde una perspectiva global, y adquirir una conciencia cívica responsable, inspirada por los valores de la Constitución Española, así como por los derechos humanos, que fomente la corresponsabilidad en la construcción de una sociedad justa y equitativa."
    },
    {
        "etapa": "BACH",
        "descripcion": "Consolidar una madurez personal, afectivo-sexual y social que les permita actuar de forma respetuosa, responsable y autónoma y desarrollar su espíritu crítico. Prever, detectar y resolver pacíficamente los conflictos personales, familiares y sociales, así como las posibles situaciones de violencia."
    },
    {
        "etapa": "BACH",
        "descripcion": "Fomentar la igualdad efectiva de derechos y oportunidades de mujeres y hombres, analizar y valorar críticamente las desigualdades existentes, así como el reconocimiento y enseñanza del papel de las mujeres en la historia e impulsar la igualdad real y la no discriminación por razón de nacimiento, sexo, origen racial o étnico, discapacidad, edad, enfermedad, religión o creencias, orientación sexual o identidad de género o cualquier otra condición o circunstancia personal o social."
    },
    {
        "etapa": "BACH",
        "descripcion": "Afianzar los hábitos de lectura, estudio y disciplina, como condiciones necesarias para el eficaz aprovechamiento del aprendizaje, y como medio de desarrollo personal."
    },
    {
        "etapa": "BACH",
        "descripcion": "Dominar, tanto en su expresión oral como escrita, la lengua castellana, profundizando en el conocimiento, la lectura y el estudio de la literatura, conociendo y apreciando la peculiaridad lingüística andaluza en todas sus variedades."
    },
    {
        "etapa": "BACH",
        "descripcion": "Expresarse con fluidez y corrección en una o más lenguas extranjeras."
    },
    {
        "etapa": "BACH",
        "descripcion": "Utilizar con solvencia y responsabilidad las tecnologías de la información y la comunicación."
    },
    {
        "etapa": "BACH",
        "descripcion": "Conocer y valorar críticamente las realidades del mundo contemporáneo, sus antecedentes históricos y los principales factores de su evolución. Participar de forma solidaria en el desarrollo y mejora de su entorno social, valorando y reconociendo los elementos específicos de la historia y la cultura andaluza, tales como el flamenco y otros hechos diferenciadores de nuestra Comunidad, para que sea valorada y respetada como patrimonio propio y en el marco de la cultura española y universal."
    },
    {
        "etapa": "BACH",
        "descripcion": "Acceder a los conocimientos científicos y tecnológicos fundamentales y dominar las habilidades básicas propias de la modalidad elegida."
    },
    {
        "etapa": "BACH",
        "descripcion": "Comprender los elementos y procedimientos fundamentales de la investigación y de los métodos científicos. Conocer y valorar de forma crítica la contribución de la ciencia y la tecnología en el cambio de las condiciones de vida, así como afianzar la sensibilidad y el respeto hacia el medio ambiente, conociendo y apreciando el medio físico y natural de Andalucía."
    },
    {
        "etapa": "BACH",
        "descripcion": "Afianzar el espíritu emprendedor con actitudes de creatividad, flexibilidad, iniciativa, trabajo en equipo, confianza en uno mismo y sentido crítico."
    },
    {
        "etapa": "BACH",
        "descripcion": "Desarrollar la sensibilidad artística y literaria, así como el criterio estético, como fuentes de formación y enriquecimiento cultural."
    },
    {
        "etapa": "BACH",
        "descripcion": "Utilizar la educación física y el deporte para favorecer el desarrollo personal y social. Afianzar los hábitos de actividades físico-deportivas para favorecer el bienestar físico y mental, así como medio de desarrollo personal y social."
    },
    {
        "etapa": "BACH",
        "descripcion": "Afianzar actitudes de respeto y prevención en el ámbito de la movilidad segura y saludable."
    },
    {
        "etapa": "BACH",
        "descripcion": "Fomentar una actitud responsable y comprometida en la lucha contra el cambio climático y en la defensa del desarrollo sostenible."
    }
]