[
    "Números naturales. Sistemas de numeración.",
    "Fundamentos y aplicaciones de la teoría de grafos. Diagramas en árbol.",
    "Técnicas de recuento. Combinatoria.",
    "Números enteros. Divisibilidad. Números primos. Congruencia.",
    "Números racionales.",
    "Números reales. Topología de la recta real.",
    "Aproximación de números. Errores. Notación científica.",
    "Sucesiones. Término general y forma recurrente. Progresiones aritméticas y geométricas. Aplicaciones.",
    "Números complejos. Aplicaciones geométricas.",
    "Sucesivas ampliaciones del concepto de número. Evolución histórica y problemas que resuelve cada una.",
    "Conceptos básicos de la teoría de conjuntos. Estructuras algebraicas.",
    "Espacios vectoriales. Variedades lineales. Aplicaciones entre espacios vectoriales. Teoremas de isomorfía.",
    "Polinomios. Operaciones. Fórmula de Newton. Divisibilidad de polinomios. Fracciones algebraicas.",
    "Ecuaciones. Resolución de ecuaciones. Aproximación numérica de raíces.",
    "Ecuaciones diofánticas.",
    "Discusión y resolución de sistemas de ecuaciones lineales. Teorema de Rouche. Regla de Cramer. Método de Gauss-Jordan.",
    "Programación lineal. Aplicaciones.",
    "Matrices. Algebra de matrices. Aplicaciones al campo de las Ciencias Sociales y de la Naturaleza.",
    "Determinantes. Propiedades. Aplicación al cálculo del rango de una matriz.",
    "El lenguaje algebraico. Símbolos y números. Importancia de su desarrollo y problemas que resuelve. Evolución histórica del álgebra.",
    "Funciones reales de variable real. Funciones elementales; situaciones reales en las que aparecen. Composición de funciones.",
    "Funciones exponenciales y logarítmicas. Situaciones reales en las que aparecen.",
    "Funciones circulares e hiperbólicas y sus recíprocas. Situaciones reales en las que aparecen.",
    "Funciones dadas en forma de tabla. Interpolación polinómica. Interpolación y extrapolación de datos.",
    "Límites de funciones. Continuidad y discontinuidades. Teorema de Bolzano. Ramas infinitas.",
    "Derivada de una función en un punto. Función derivada. Derivadas sucesivas. Aplicaciones.",
    "Desarrollo de una función en serie de potencias. Teorema de Taylor. Aplicaciones al estudio local de funciones.",
    "Estudio global de funciones. Aplicaciones a la representación gráfica de funciones.",
    "El problema del cálculo del área. Integral definida.",
    "Primitiva de una función. Cálculo de algunas primitivas. Aplicaciones de la integral al cálculo de magnitudes geométricas.",
    "Integración numérica. Métodos y aplicaciones.",
    "Aplicación del estudio de funciones a la interpretación y resolución de problemas de la Economía, las Ciencias Sociales y la Naturaleza.",
    "Evolución histórica del cálculo diferencial.",
    "Análisis y formalización de los conceptos geométricos intuitivos: incidencia, paralelismo, perpendicularidad, ángulo, etc.",
    "Las magnitudes y su medida. Fundamentación de los conceptos relacionados con ellas.",
    "Proporciones notables. La razón áurea. Aplicaciones.",
    "La relación de semejanza en el plano. Consecuencias. Teorema de Thales. Razones trigonométricas.",
    "Trigonometría plana. Resolución de triángulos. Aplicaciones.",
    "Geometría del triángulo.",
    "Geometría de la circunferencia. Ángulos en la circunferencia. Potencia de un punto a una circunferencia.",
    "Movimientos en el plano. Composición de movimientos. Aplicación al estudio de las teselaciones del plano. Frisos y mosaicos.",
    "Homotecia y semejanza en el plano.",
    "Proyecciones en el plano. Mapas. Planisferios terrestres: principales sistemas de representación.",
    "Semejanza y movimientos en el espacio.",
    "Poliedros. Teorema de Euler. Sólidos platónicos y arquimedianos.",
    "Distintas coordenadas para describir el plano o el espacio, ecuaciones de curvas y superficies.",
    "Generación de curvas como envolventes.",
    "Espirales y hélices. Presencia en la Naturaleza, en el Arte y en la Técnica.",
    "Superficies de revolución. Cuádricas. Superficies regladas. Presencia en la Naturaleza, en el Arte y en la Técnica.",
    "Introducción a las geometrías no euclideas. Geometría esférica.",
    "Sistemas de referencia en el plano y en el espacio. Ecuaciones de la recta y del plano. Relaciones afines.",
    "Producto escalar de vectores. Producto vectorial y producto mixto. Aplicaciones a la resolución de problemas físicos y geométricos.",
    "Relaciones métricas: perpendicularidad, distancias, ángulos, áreas, volúmenes, etc...",
    "Las cónicas como secciones planas de una superficie cónica. Estudio analítico. Presencia en la Naturaleza, el Arte y la Técnica.",
    "La Geometría fractal. Nociones básicas.",
    "Evolución histórica de la geometría.",
    "Usos de la Estadística: Estadística descriptiva y Estadística inferencial. Métodos básicos y aplicaciones de cada una de ellas.",
    "Población y muestra. Condiciones de representatividad de una muestra. Tipos de muestreo. Tamaño de una muestra.",
    "Técnicas de obtención y representación de datos. Tablas y gráficas estadísticas. Tendenciosidad y errores más comunes.",
    "Parámetros estadísticos. Cálculo, significado y propiedades.",
    "Desigualdad de Tchebyschev. Coeficiente de variación. Variable normalizada. Aplicación al análisis, interpretación y comparación de datos estadísticos.",
    "Series estadísticas bidimensionales. Regresión y correlación lineal. Coeficiente de correlación. Significado y aplicaciones.",
    "Frecuencia y probabilidad. Leyes del azar. Espacio probabilístico.",
    "Probabilidad compuesta. Probabilidad condicionada. Probabilidad total. Teorema de Bayes.",
    "Distribuciones de probabilidad de variables discreta. Características y tratamiento. Las distribuciones binomial y de Poisson. Aplicaciones.",
    "Distribuciones de probabilidad de variable continua. Características y tratamiento. La distribución normal. Aplicaciones.",
    "Inferencia estadística. Tests de hipótesis.",
    "Aplicaciones de la estadística y el Cálculo de Probabilidades al estudio y toma de decisiones en problemas de las Ciencias Sociales y de la Naturaleza. Evolución histórica.",
    "La resolución de problemas en Matemáticas. Estrategias. Importancia histórica.",
    "Lógica proposicional. Ejemplos y aplicaciones al razonamiento matemático.",
    "La controversia sobre los fundamentos de la Matemática. Las limitaciones internas de los sistemas formales."
]